/*********************************************************************************************************************
* TC264 Opensourec Library 锟斤拷锟斤拷TC264 锟斤拷源锟解）锟斤拷一锟斤拷锟斤拷锟节官凤拷 SDK 锟接口的碉拷锟斤拷锟斤拷锟斤拷源锟斤拷
* Copyright (c) 2022 SEEKFREE 锟斤拷煽萍锟�
*
* 锟斤拷锟侥硷拷锟斤拷 TC264 锟斤拷源锟斤拷锟揭伙拷锟斤拷锟�
*
* TC264 锟斤拷源锟斤拷 锟斤拷锟斤拷锟斤拷锟斤拷
* 锟斤拷锟斤拷锟皆革拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟结发锟斤拷锟斤拷 GPL锟斤拷GNU General Public License锟斤拷锟斤拷 GNU通锟矫癸拷锟斤拷锟斤拷锟街わ拷锟斤拷锟斤拷锟斤拷锟�
* 锟斤拷 GPL 锟侥碉拷3锟芥（锟斤拷 GPL3.0锟斤拷锟斤拷锟斤拷选锟斤拷模锟斤拷魏魏锟斤拷锟斤拷陌姹撅拷锟斤拷锟斤拷路锟斤拷锟斤拷锟�/锟斤拷锟睫革拷锟斤拷
*
* 锟斤拷锟斤拷源锟斤拷姆锟斤拷锟斤拷锟较ｏ拷锟斤拷锟斤拷芊锟斤拷锟斤拷锟斤拷茫锟斤拷锟斤拷锟轿达拷锟斤拷锟斤拷锟斤拷魏蔚谋锟街�
* 锟斤拷锟斤拷没锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟皆伙拷锟绞猴拷锟截讹拷锟斤拷途锟侥憋拷证
* 锟斤拷锟斤拷细锟斤拷锟斤拷渭锟� GPL
*
* 锟斤拷应锟斤拷锟斤拷锟秸碉拷锟斤拷锟斤拷源锟斤拷锟酵憋拷盏锟揭伙拷锟� GPL 锟侥革拷锟斤拷
* 锟斤拷锟矫伙拷校锟斤拷锟斤拷锟斤拷<https://www.gnu.org/licenses/>
*
* 锟斤拷锟斤拷注锟斤拷锟斤拷
* 锟斤拷锟斤拷源锟斤拷使锟斤拷 GPL3.0 锟斤拷源锟斤拷锟街ば拷锟� 锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟轿拷锟斤拷陌姹�
* 锟斤拷锟斤拷锟斤拷锟接拷陌锟斤拷锟� libraries/doc 锟侥硷拷锟斤拷锟铰碉拷 GPL3_permission_statement.txt 锟侥硷拷锟斤拷
* 锟斤拷锟街わ拷锟斤拷锟斤拷锟� libraries 锟侥硷拷锟斤拷锟斤拷 锟斤拷锟斤拷锟侥硷拷锟斤拷锟铰碉拷 LICENSE 锟侥硷拷
* 锟斤拷迎锟斤拷位使锟矫诧拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷 锟斤拷锟睫革拷锟斤拷锟斤拷时锟斤拷锟诫保锟斤拷锟斤拷煽萍锟斤拷陌锟饺拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟�
*
* 锟侥硷拷锟斤拷锟斤拷          cpu0_main
* 锟斤拷司锟斤拷锟斤拷          锟缴讹拷锟斤拷煽萍锟斤拷锟斤拷薰锟剿�
* 锟芥本锟斤拷息          锟介看 libraries/doc 锟侥硷拷锟斤拷锟斤拷 version 锟侥硷拷 锟芥本说锟斤拷
* 锟斤拷锟斤拷锟斤拷锟斤拷          ADS v1.8.0
* 锟斤拷锟斤拷平台          TC264D
* 锟斤拷锟斤拷锟斤拷锟斤拷          https://seekfree.taobao.com/
*
* 锟睫改硷拷录
* 锟斤拷锟斤拷              锟斤拷锟斤拷                锟斤拷注
* 2022-09-15       pudding            first version
********************************************************************************************************************/
#include "zf_common_headfile.h"
#include "elab_assert.h"
#include "elab_log.h"
#include "elab_export.h"
#pragma section all "cpu0_dsram"
// 锟斤拷锟斤拷锟斤拷锟斤拷锟�#pragma section all restore锟斤拷锟街拷锟斤拷全锟街憋拷锟斤拷锟斤拷锟斤拷锟斤拷CPU0锟斤拷RAM锟斤拷

// *************************** 锟斤拷锟斤拷硬锟斤拷锟斤拷锟斤拷说锟斤拷 ***************************
// 锟斤拷锟侥帮拷锟斤拷锟斤拷锟斤拷锟界即锟斤拷 锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟�
// 锟斤拷锟绞癸拷锟斤拷锟斤拷锟斤拷锟斤拷 锟斤拷锟斤拷锟斤拷锟揭拷玫锟截癸拷锟斤拷


// *************************** 锟斤拷锟教诧拷锟斤拷说锟斤拷 ***************************
// 1.锟斤拷锟侥帮拷锟斤拷录锟斤拷杀锟斤拷锟斤拷蹋锟斤拷锟斤拷锟较碉拷
// 2.锟斤拷锟皆匡拷锟斤拷锟斤拷锟侥帮拷锟斤拷锟侥革拷 LED 锟斤拷锟斤拷水锟斤拷状锟斤拷烁
// 3.锟斤拷 SWITCH1 / SWITCH2 锟斤拷锟斤拷锟疥定锟斤拷锟接︼拷锟斤拷锟斤拷欧直锟斤拷锟� 00 01 10 11 锟斤拷锟斤拷辖拥锟� 1-VCC 0-GND 锟斤拷锟竭诧拷锟斤拷锟斤拷应锟斤拷锟斤拷牟锟斤拷肟拷锟�
// 3.锟斤拷同锟斤拷锟斤拷锟斤拷拢锟斤拷母锟� LED 锟斤拷水锟斤拷状锟斤拷烁锟斤拷频锟绞会发锟斤拷锟戒化
// 4.锟斤拷 KEY1 / KEY2 / KEY3 / KEY4 锟斤拷锟斤拷锟疥定锟斤拷锟接︼拷锟斤拷锟斤拷沤拥锟� 1-VCC 0-GND 锟斤拷锟斤拷 锟斤拷锟斤拷应锟斤拷锟斤拷
// 5.锟斤拷锟斤拷锟斤拷锟脚斤拷 GND 锟斤拷锟斤拷 锟斤拷锟斤拷锟斤拷锟铰伙拷使锟斤拷锟斤拷锟斤拷LED一锟斤拷锟斤拷烁 锟缴匡拷锟斤拷指锟斤拷锟剿拷锟�
// 锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟剿碉拷锟斤拷锟斤拷夭锟斤拷锟� 锟斤拷锟斤拷毡锟斤拷募锟斤拷锟斤拷路锟� 锟斤拷锟教筹拷锟斤拷锟斤拷锟斤拷说锟斤拷 锟斤拷锟斤拷锟脚诧拷

// **************************** 锟斤拷锟斤拷锟斤拷锟斤拷 ****************************
#define LED1                    (P20_9)
#define LED2                    (P20_8)
#define LED3                    (P21_5)
#define LED4                    (P21_4)

#define KEY1                    (P20_6)
#define KEY2                    (P20_7)
#define KEY3                    (P11_2)
#define KEY4                    (P11_3)

#define SWITCH1                 (P33_11)
#define SWITCH2                 (P33_12)
ELAB_TAG("Main_cpu0");


uint16 delay_time = 0;
uint8 led_state = 0;


void funcA(uint32_t *handle)
{
    elog_debug("funcA");
}
INIT_EXPORT(funcA,EXPORT_DRVIVER);
int core0_main(void)
{


    clock_init();                   // 锟斤拷取时锟斤拷频锟斤拷<锟斤拷乇锟斤拷锟�>
    debug_init();                   // 锟斤拷始锟斤拷默锟较碉拷锟皆达拷锟斤拷
    // 锟剿达拷锟斤拷写锟矫伙拷锟斤拷锟斤拷 锟斤拷锟斤拷锟斤拷锟斤拷锟绞硷拷锟斤拷锟斤拷锟斤拷





    gpio_init(LED1, GPO, GPIO_LOW, GPO_PUSH_PULL);          // 锟斤拷始锟斤拷 LED1 锟斤拷锟� 默锟较高碉拷平 锟斤拷锟斤拷锟斤拷锟侥Ｊ�
    gpio_init(LED2, GPO, GPIO_HIGH, GPO_PUSH_PULL);         // 锟斤拷始锟斤拷 LED2 锟斤拷锟� 默锟较高碉拷平 锟斤拷锟斤拷锟斤拷锟侥Ｊ�
    gpio_init(LED3, GPO, GPIO_LOW, GPO_PUSH_PULL);          // 锟斤拷始锟斤拷 LED3 锟斤拷锟� 默锟较高碉拷平 锟斤拷锟斤拷锟斤拷锟侥Ｊ�
    gpio_init(LED4, GPO, GPIO_HIGH, GPO_PUSH_PULL);         // 锟斤拷始锟斤拷 LED4 锟斤拷锟� 默锟较高碉拷平 锟斤拷锟斤拷锟斤拷锟侥Ｊ�

    gpio_init(KEY1, GPI, GPIO_HIGH, GPI_PULL_UP);           // 锟斤拷始锟斤拷 KEY1 锟斤拷锟斤拷 默锟较高碉拷平 锟斤拷锟斤拷锟斤拷锟斤拷
    gpio_init(KEY2, GPI, GPIO_HIGH, GPI_PULL_UP);           // 锟斤拷始锟斤拷 KEY2 锟斤拷锟斤拷 默锟较高碉拷平 锟斤拷锟斤拷锟斤拷锟斤拷
    gpio_init(KEY3, GPI, GPIO_HIGH, GPI_PULL_UP);           // 锟斤拷始锟斤拷 KEY3 锟斤拷锟斤拷 默锟较高碉拷平 锟斤拷锟斤拷锟斤拷锟斤拷
    gpio_init(KEY4, GPI, GPIO_HIGH, GPI_PULL_UP);           // 锟斤拷始锟斤拷 KEY4 锟斤拷锟斤拷 默锟较高碉拷平 锟斤拷锟斤拷锟斤拷锟斤拷

    gpio_init(SWITCH1, GPI, GPIO_HIGH, GPI_PULL_UP);        // 锟斤拷始锟斤拷 SWITCH1 锟斤拷锟斤拷 默锟较高碉拷平 锟斤拷锟斤拷锟斤拷锟斤拷
    gpio_init(SWITCH2, GPI, GPIO_HIGH, GPI_PULL_UP);        // 锟斤拷始锟斤拷 SWITCH2 锟斤拷锟斤拷 默锟较高碉拷平 锟斤拷锟斤拷锟斤拷锟斤拷

    // 锟剿达拷锟斤拷写锟矫伙拷锟斤拷锟斤拷 锟斤拷锟斤拷锟斤拷锟斤拷锟绞硷拷锟斤拷锟斤拷锟斤拷
    cpu_wait_event_ready();         // 锟饺达拷锟斤拷锟叫猴拷锟侥筹拷始锟斤拷锟斤拷锟�


    elab_run();
	while (TRUE)
	{


        // 锟剿达拷锟斤拷写锟斤拷要循锟斤拷执锟叫的达拷锟斤拷
	    delay_time = 300;
	    if(gpio_get_level(SWITCH1)) delay_time /= 2;
	    if(gpio_get_level(SWITCH2)) delay_time /= 2;
	    if( !gpio_get_level(KEY1) || !gpio_get_level(KEY2) || !gpio_get_level(KEY3) || !gpio_get_level(KEY4) )         // 锟斤拷取 KEYx 锟斤拷平为锟斤拷
	    {
	        gpio_set_level(LED1, led_state);
	        gpio_set_level(LED2, led_state);
	        gpio_set_level(LED3, led_state);
	        gpio_set_level(LED4, led_state);
	    }
	    else
	    {
            gpio_set_level(LED1, led_state);
            gpio_set_level(LED2, !led_state);
            gpio_set_level(LED3, led_state);
            gpio_set_level(LED4, !led_state);
	    }
	    led_state = !led_state;


	    system_delay_ms(delay_time);
        // 锟剿达拷锟斤拷写锟斤拷要循锟斤拷执锟叫的达拷锟斤拷
	}
}

#pragma section all restore
// **************************** 锟斤拷锟斤拷锟斤拷锟斤拷 ****************************

// *************************** 锟斤拷锟教筹拷锟斤拷锟斤拷锟斤拷说锟斤拷 ***************************
// 锟斤拷锟斤拷锟斤拷锟斤拷时锟诫按锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟叫憋拷锟斤拷
// 锟斤拷锟斤拷1锟斤拷LED 锟斤拷锟斤拷烁
//      锟斤拷锟绞癸拷锟斤拷锟斤拷锟斤拷锟皆ｏ拷锟斤拷锟斤拷锟斤拷锟揭拷玫锟截癸拷锟斤拷
//      锟介看锟斤拷锟斤拷锟角凤拷锟斤拷锟斤拷锟斤拷录锟斤拷锟角凤拷锟斤拷锟截憋拷锟斤拷确锟斤拷锟斤拷锟斤拷锟斤拷锟铰革拷位锟斤拷锟斤拷
//      锟斤拷锟矫憋拷锟斤拷锟斤拷锟接� LED 锟斤拷锟脚碉拷压锟角凤拷浠拷锟斤拷锟斤拷锟斤拷锟戒化证锟斤拷锟斤拷锟斤拷未锟斤拷锟叫ｏ拷锟斤拷锟斤拷浠わ拷锟� LED 锟斤拷锟斤拷锟斤拷
// 锟斤拷锟斤拷2锟斤拷SWITCH1 / SWITCH2 锟斤拷锟斤拷锟斤拷锟斤拷锟剿拷锟狡碉拷锟斤拷薇浠�
//      锟斤拷锟绞癸拷锟斤拷锟斤拷锟斤拷锟皆ｏ拷锟斤拷锟斤拷锟斤拷锟揭拷玫锟截癸拷锟斤拷
//      锟介看锟斤拷锟斤拷锟角凤拷锟斤拷锟斤拷锟斤拷录锟斤拷锟角凤拷锟斤拷锟截憋拷锟斤拷确锟斤拷锟斤拷锟斤拷锟斤拷锟铰革拷位锟斤拷锟斤拷
//      锟斤拷锟矫憋拷锟斤拷锟斤拷锟接� LED 锟斤拷锟脚碉拷压锟角凤拷浠拷锟斤拷锟斤拷锟斤拷锟戒化证锟斤拷锟斤拷锟斤拷未锟斤拷锟叫ｏ拷锟斤拷锟斤拷浠わ拷锟� LED 锟斤拷锟斤拷锟斤拷
//      锟斤拷锟矫憋拷锟斤拷锟接� SWITCH1 / SWITCH2 锟斤拷锟脚碉拷压锟角凤拷锟斤拷锟斤拷锟戒化锟斤拷锟角凤拷锟斤拷锟斤拷锟斤拷藕挪锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷欠锟接达拷
// 锟斤拷锟斤拷2锟斤拷KEY1 / KEY2 / KEY3 / KEY4 锟斤拷GND锟斤拷锟竭帮拷锟斤拷锟斤拷锟斤拷锟睫变化
//      锟斤拷锟绞癸拷锟斤拷锟斤拷锟斤拷锟皆ｏ拷锟斤拷锟斤拷锟斤拷锟揭拷玫锟截癸拷锟斤拷
//      锟介看锟斤拷锟斤拷锟角凤拷锟斤拷锟斤拷锟斤拷录锟斤拷锟角凤拷锟斤拷锟截憋拷锟斤拷确锟斤拷锟斤拷锟斤拷锟斤拷锟铰革拷位锟斤拷锟斤拷
//      锟斤拷锟矫憋拷锟斤拷锟斤拷锟接� LED 锟斤拷锟脚碉拷压锟角凤拷浠拷锟斤拷锟斤拷锟斤拷锟戒化证锟斤拷锟斤拷锟斤拷未锟斤拷锟叫ｏ拷锟斤拷锟斤拷浠わ拷锟� LED 锟斤拷锟斤拷锟斤拷
//      锟斤拷锟矫憋拷锟斤拷锟接� KEY1 / KEY2 / KEY3 / KEY4 锟斤拷锟脚碉拷压锟角凤拷锟斤拷锟斤拷锟戒化锟斤拷锟角凤拷锟斤拷锟斤拷锟斤拷藕挪锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷欠锟接达拷

